/*************************************************************************************************************
 * 
 * Parallelisim STL (Standard template library)
 * (Çoklu program çalıştırmak)
 * 
 *************************************************************************************************************/
///////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Example1

#include <iostream>
#include <thread>

using namespace std;

void myThread(){
    cout << "My Thread" << endl;
}

int main(){

    // Thread oluşturma
    thread t(&myThread); // Thread başlatırdı.

    cout << "Main" << endl;

    t.join();

    
    return 0;
}